In [1]:
def dataframe_is_subset(df1, df2):
    column_set1 = set(df1.columns)
    column_set2 = set(df1.columns)
    if not column_set1.issubset(column_set2):
        return False

    trans_column_set2 = df2[df1.columns]
    sentence_set1 = set()
    sentence_set2 = set()

    for index, row in df1.iterrows():
        sentence = ''
        for c in df1.columns:
            sentence += f'{row[c]}'
        sentence_set1.add(sentence)

    for index, row in trans_column_set2.iterrows():
        sentence = ''
        for c in df1.columns:
            sentence += f'{row[c]}'
        sentence_set2.add(sentence)

    return sentence_set1 == sentence_set2

In [10]:
import pandas as pd

df1 = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 33, 41, 29, 27],
    'Gender': ['F', 'M', 'M', 'M', 'F'],
    'Salary': [50000, 60000, 70000, 55000, 65000]
})

df2 = df1.sample(frac=1).reset_index(drop=True)[ ['Name',  'Age']]

In [15]:
type(df1) == str

False

In [12]:
df2

      Name  Age
0    Alice   25
1      Bob   33
2    David   29
3  Charlie   41
4      Eva   27

In [13]:
dataframe_is_subset(df2, df1)

True

In [17]:
import re
def contains_sqlite_functions(sql):
    sqlite_functions = [
        "SUBSTR", "SUBSTRING", "TRIM", "REPLACE", "ROUND", 
        "ABS", "LENGTH", "LOWER", "UPPER", "JULIANDAY", 
        "STRFTIME", "strftime", "CAST", "COALESCE", "IFNULL", 
        "NULLIF", "GROUP_CONCAT", "SUBSTRING_INDEX",
        # "DATE", "TIME", "DATETIME",
    ]
    pattern = "|".join(sqlite_functions)
    return bool(re.search(pattern, sql))
contains_sqlite_functions("SELECT cyclist, SUBSTRING_INDEX(cyclist, \" (\", 1) AS country FROM DF WHERE rank<=10;")

True